# Rebar Shape Get Default Hook Orientation Method

Source: https://www.revitapidocs.com/2026/2a97de53-42d6-cf64-f998-73ad9b79fcf0.htm

---

| Rebar Shape Get Default Hook Orientation Method |
| --- |

**Note: This API is now obsolete.**

Gets the termination's orientation. The orientation it's the same for both hook and crank.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarShape.GetTerminationsData().TerminationOrientationAtStart or RebarShape.GetTerminationsData().TerminationOrientationAtEnd instead.")]
public RebarHookOrientation GetDefaultHookOrientation(
	int end
)
```

```
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarShape.GetTerminationsData().TerminationOrientationAtStart or RebarShape.GetTerminationsData().TerminationOrientationAtEnd instead.")>
Public Function GetDefaultHookOrientation (
	end As Integer
) As RebarHookOrientation
```

```
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarShape.GetTerminationsData().TerminationOrientationAtStart or RebarShape.GetTerminationsData().TerminationOrientationAtEnd instead.")]
RebarHookOrientation GetDefaultHookOrientation(
	int end
)
```

```
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarShape.GetTerminationsData().TerminationOrientationAtStart or RebarShape.GetTerminationsData().TerminationOrientationAtEnd instead.")>]
member GetDefaultHookOrientation :
        end : int -> RebarHookOrientation
```

#### Parameters

end Int32
:   0 for the termination at start, 1 for the termination at end.

#### Return Value

RebarHookOrientation
Returns the termination's orientation. The orientation it's the same for both hook and crank. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | end must be 0 or 1\. |

See Also

#### Reference

RebarShape Class Autodesk.Revit.DB.Structure Namespace